import Head from "next/head";
import Image from "next/image";
import styles from "../styles/Home.module.css";
import { Work_Sans, Sarabun } from "@next/font/google";

const workSans = Work_Sans({
  subsets: ["latin"],
  weight: "400",
});

const sarabun = Sarabun({
  subsets: ["latin"],
  weight: "400",
});

export default function Home() {
  return (
    <>
      Sarabun Regular 400 at 32px <br />
      <p className={sarabun.className} style={{ fontSize: 32, color: "blue" }}>
        ทุกคนย่อมมีสิทธิในความเสมอภาคอย่างเต็มที่ในการได้รับการพิจารณาคดีที่เป็นธรรมและเปิดเผยจากศาลที่อิสระและไม่ลำเอียง
        ในการพิจารณากำหนดสิทธิและหน้าที่ของตนและข้อกล่าวหาอาญาใดต่อตน
      </p>
      Work_Sans Regular 400 at 21px <br />
      <p className={workSans.className} style={{ fontSize: 21 }}>
        No one shall be subjected to arbitrary arrest, detention or exile.
        Everyone is entitled in full equality to a fair and public hearing by an
        independent and impartial tribunal, in the determination of his rights
        and obligations and of any criminal charge against him. No one shall be
        subjected to arbitrary interference with his privacy, family, home or
        correspondence, nor to attacks upon his honour and reputation. Everyone
        has the right to the protection of the law against such interference or
        attacks.
        <br /> <br />
      </p>
      Sarabun Regular 400 at 16px <br />
      <p className={sarabun.className} style={{ fontSize: 16 }}>
        โดยที่การยอมรับศักดิ์ศรีแต่กำเนิด
        และสิทธิที่เท่าเทียมกันและที่ไม่อาจเพิกถอนได้ของสมาชิกทั้งมวลแห่งครอบครัวมนุษยชาติ
        เป็นพื้นฐานแห่งอิสรภาพ ความยุติธรรม และสันติภาพในโลก
        การไม่นำพาและการหมิ่นในคุณค่าของสิทธิมนุษยชน
        ยังผลให้มีการกระทำอันป่าเถื่อน
        ซึ่งเป็นการขัดอย่างร้ายแรงต่อมโนธรรมของมนุษยชาติ
        และการมาถึงของโลกที่ได้มีการประกาศให้ความมีอิสรภาพในการพูดและความเชื่อ
        และอิสรภาพจากความหวาดกลัวและความต้องการของมนุษย์
        เป็นความปรารถนาสูงสุดของประชาชนทั่วไป
        โดยที่เป็นการจำเป็นที่สิทธิมนุษยชนควรได้รับความคุ้มครองโดยหลักนิติธรรม
        ถ้าจะไม่บังคับให้คนต้องหันเข้าหาการลุกขึ้นต่อต้านทรราชและการกดขี่เป็นวิถีทางสุดท้าย
        โดยที่เป็นการจำเป็นที่จะส่งเสริมพัฒนาการแห่งความสัมพันธ์ฉันมิตรระหว่างชาติต่างๆ
      </p>
      Sarabun Regular 400 at 14px <br />
      <p className={sarabun.className} style={{ fontSize: 14 }}>
        โดยที่การยอมรับศักดิ์ศรีแต่กำเนิด
        และสิทธิที่เท่าเทียมกันและที่ไม่อาจเพิกถอนได้ของสมาชิกทั้งมวลแห่งครอบครัวมนุษยชาติ
        เป็นพื้นฐานแห่งอิสรภาพ ความยุติธรรม และสันติภาพในโลก
        การไม่นำพาและการหมิ่นในคุณค่าของสิทธิมนุษยชน
        ยังผลให้มีการกระทำอันป่าเถื่อน
        ซึ่งเป็นการขัดอย่างร้ายแรงต่อมโนธรรมของมนุษยชาติ
        และการมาถึงของโลกที่ได้มีการประกาศให้ความมีอิสรภาพในการพูดและความเชื่อ
        และอิสรภาพจากความหวาดกลัวและความต้องการของมนุษย์
        เป็นความปรารถนาสูงสุดของประชาชนทั่วไป
        โดยที่เป็นการจำเป็นที่สิทธิมนุษยชนควรได้รับความคุ้มครองโดยหลักนิติธรรม
        ถ้าจะไม่บังคับให้คนต้องหันเข้าหาการลุกขึ้นต่อต้านทรราชและการกดขี่เป็นวิถีทางสุดท้าย
        โดยที่เป็นการจำเป็นที่จะส่งเสริมพัฒนาการแห่งความสัมพันธ์ฉันมิตรระหว่างชาติต่างๆ
      </p>
      Sarabun Regular 400 at 12px <br />
      <p className={sarabun.className} style={{ fontSize: 12 }}>
        โดยที่การยอมรับศักดิ์ศรีแต่กำเนิด
        และสิทธิที่เท่าเทียมกันและที่ไม่อาจเพิกถอนได้ของสมาชิกทั้งมวลแห่งครอบครัวมนุษยชาติ
        เป็นพื้นฐานแห่งอิสรภาพ ความยุติธรรม และสันติภาพในโลก
        การไม่นำพาและการหมิ่นในคุณค่าของสิทธิมนุษยชน
        ยังผลให้มีการกระทำอันป่าเถื่อน
        ซึ่งเป็นการขัดอย่างร้ายแรงต่อมโนธรรมของมนุษยชาติ
        และการมาถึงของโลกที่ได้มีการประกาศให้ความมีอิสรภาพในการพูดและความเชื่อ
        และอิสรภาพจากความหวาดกลัวและความต้องการของมนุษย์
        เป็นความปรารถนาสูงสุดของประชาชนทั่วไป
        โดยที่เป็นการจำเป็นที่สิทธิมนุษยชนควรได้รับความคุ้มครองโดยหลักนิติธรรม
        ถ้าจะไม่บังคับให้คนต้องหันเข้าหาการลุกขึ้นต่อต้านทรราชและการกดขี่เป็นวิถีทางสุดท้าย
        โดยที่เป็นการจำเป็นที่จะส่งเสริมพัฒนาการแห่งความสัมพันธ์ฉันมิตรระหว่างชาติต่างๆ
      </p>
      Sarabun Regular 400 at 9px <br />
      <p className={sarabun.className} style={{ fontSize: 9 }}>
        โดยที่การยอมรับศักดิ์ศรีแต่กำเนิด
        และสิทธิที่เท่าเทียมกันและที่ไม่อาจเพิกถอนได้ของสมาชิกทั้งมวลแห่งครอบครัวมนุษยชาติ
        เป็นพื้นฐานแห่งอิสรภาพ ความยุติธรรม และสันติภาพในโลก
        การไม่นำพาและการหมิ่นในคุณค่าของสิทธิมนุษยชน
        ยังผลให้มีการกระทำอันป่าเถื่อน
        ซึ่งเป็นการขัดอย่างร้ายแรงต่อมโนธรรมของมนุษยชาติ
        และการมาถึงของโลกที่ได้มีการประกาศให้ความมีอิสรภาพในการพูดและความเชื่อ
        และอิสรภาพจากความหวาดกลัวและความต้องการของมนุษย์
        เป็นความปรารถนาสูงสุดของประชาชนทั่วไป
        โดยที่เป็นการจำเป็นที่สิทธิมนุษยชนควรได้รับความคุ้มครองโดยหลักนิติธรรม
        ถ้าจะไม่บังคับให้คนต้องหันเข้าหาการลุกขึ้นต่อต้านทรราชและการกดขี่เป็นวิถีทางสุดท้าย
        โดยที่เป็นการจำเป็นที่จะส่งเสริมพัฒนาการแห่งความสัมพันธ์ฉันมิตรระหว่างชาติต่างๆ
      </p>
    </>
  );
}
